app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                     <%= link_to book_favorites_path(book), method: :delete , remote: true , class:"favorited" do %>
                      ♥<%= book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                     <%= link_to book_favorites_path(book), method: :post , remote: true do %>
                      ♡<%= book.favorites.count %> いいね