app/views/groups/show.html.erb

        <td>
          <% @group.users.where.not(id: @group.id).each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ? AND "users"."id" != ?  [["group_id", 1], ["id", 1]]