app/views/users/show.html.erb

             <td>
              <p><%= "コメント数：#{book.post_comments.count}" %></p>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 4]]