app/views/books/index.html.erb

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
               <td>
                 <p><%= "コメント数：#{book.post_comments.count}" %></p>