app/views/books/show.html.erb

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 12]]
---
             <!-- コメント数 -->
             <td><p>コメント件数：<%= @book.post_comments.count %></p></td>