app/controllers/books_controller.rb

SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    #@post_images = PostImage.allを削除。左記の場合全ての画像を表示してしまうため。
    @books = Book.page(params[:page]).reverse_order

UPDATE "books" SET "impressions_count" = COALESCE("impressions_count", 0) + 1 WHERE "books"."id" = ?  [["id", 4]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)