app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."rate" DESC
---
  def index
    if params[:new]
      @books = Book.order(created_at: :desc)
    elsif params[:rate]
      @books = Book.order(rate: :desc)