app/controllers/group_users_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "group_users" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 7], ["group_id", 1], ["created_at", "2021-11-25 07:18:25.354467"], ["updated_at", "2021-11-25 07:18:25.354467"]]
---
  def create
    group = Group.find(params[:group_id])
    group_user = current_user.group_users.new(group_id: group.id)
    group_user.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "group_users".* FROM "group_users" WHERE "group_users"."user_id" = ? AND "group_users"."group_id" = ? LIMIT ?  [["user_id", 7], ["group_id", 1], ["LIMIT", 1]]
DELETE FROM "group_users" WHERE "group_users"."id" = ?  [["id", 1]]
---
  def destroy
    group = Group.find(params[:group_id])
    group_user = current_user.group_users.find_by(group_id: group.id)
    group_user.destroy