app/controllers/groups_controller.rb

INSERT INTO "group_users" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 7], ["group_id", 4], ["created_at", "2021-11-25 07:26:03.946807"], ["updated_at", "2021-11-25 07:26:03.946807"]]
INSERT INTO "groups" ("name", "introduction", "image_id", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "12"], ["introduction", "tay"], ["image_id", nil], ["owner_id", 7], ["created_at", "2021-11-25 07:19:10.381094"], ["updated_at", "2021-11-25 07:19:10.381094"]]
INSERT INTO "groups" ("name", "introduction", "image_id", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["introduction", "tests"], ["image_id", nil], ["owner_id", 7], ["created_at", "2021-11-25 07:26:03.941748"], ["updated_at", "2021-11-25 07:26:03.941748"]]
---
  def create
    @group = Group.new(group_params)
    @group.owner_id = current_user.id
    @group.users << current_user
    if @group.save

SELECT "groups".* FROM "groups"
---
  def index
    @book=Book.new
    @groups=Group.all

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "groups" SET "image_id" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["image_id", nil], ["updated_at", "2021-12-10 11:21:52.485256"], ["id", 5]]
---
  def update
    @group=Group.find(params[:id])
    if @group.update(group_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def new_mail
    @group = Group.find(params[:group_id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def send_mail
    @group = Group.find(params[:group_id])