app/controllers/inquiries_controller.rb

  def create
    inquiry = Inquiry.new(inquiry_params)
    inquiry.user_id = current_user.id
    group = Group.find(params[:id])
    if inquiry.save
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "inquiries" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["content", "test"], ["user_id", 7], ["created_at", "2021-11-29 15:35:23.900053"], ["updated_at", "2021-11-29 15:35:23.900053"]]

  def show
    @inquiry = Inquiry.find(params[:id])
---
SELECT  "inquiries".* FROM "inquiries" WHERE "inquiries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]