app/controllers/post_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    comment = current_user.post_comments.new(post_comment_params)
    comment.book_id = @book.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "kdyku"], ["user_id", 1], ["book_id", 2], ["created_at", "2021-11-20 02:46:50.661583"], ["updated_at", "2021-11-20 02:46:50.661583"]]