app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 3], ["followed_id", 10], ["created_at", "2021-11-20 03:02:05.998155"], ["updated_at", "2021-11-20 03:02:05.998155"]]
---
  def create

    user = User.find(params[:user_id])
    follower = current_user.relationships.new(followed_id: user.id)
    follower.save