app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 25], ["OFFSET", 0]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ? ORDER BY "books"."id" DESC LIMIT ? OFFSET ?) subquery_for_count  [["user_id", 4], ["created_at", "2021-11-21 00:00:00"], ["created_at", "2021-11-21 23:59:59.999999"], ["LIMIT", 25], ["OFFSET", 0]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ? ORDER BY "books"."id" DESC LIMIT ? OFFSET ?) subquery_for_count  [["user_id", 9], ["created_at", "2021-11-17 00:00:00"], ["created_at", "2021-11-18 23:59:59.999999"], ["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @users = User.page(params[:page]).reverse_order
    @user = current_user
    @books = @user.books.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def follower
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def followed
    user = User.find(params[:id])